Revit 2026 API

# RebarShapeSegmentEndReferenceType Enumeration

---

A choice of two reference points for one end of a constraint driving the length of a RebarShapeSegment.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum RebarShapeSegmentEndReferenceType
```
```vb
Public Enumeration RebarShapeSegmentEndReferenceType
```
```cpp
public enum class RebarShapeSegmentEndReferenceType
```
```fsharp
type RebarShapeSegmentEndReferenceType
```

| Member name | Value | Description |
| --- | --- | --- |
| Exterior | 1 | Refers to the farthest point on the arc of the bend. Assuming the bend is 90 degrees or more, an Exterior constraint will be longer than a Straight constraint by an amount equal to the bend radius. |
| Straight | 0 | Refers to the end of the straight part of the segment: the point where the bend begins. |

The RebarShapeSegmentEndReferenceType of a constraint is meaningful only when the bend is right or obtuse. If the bend is acute, the reference type is ignored.

#### Reference

Autodesk.Revit.DB.Structure Namespace